[
  {
    "name": "Paul Ritchie",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1641248686/images/Headshots-1-2022/Paul_Ritchie_hvoygy.jpg",
    "title": "Founder & Principal",
    "biop1": "Paul Ritchie is a founding partner and serves as Managing Partner of The Ritchie Group. Paul oversees deal-sourcing and project capitalization, focusing on the guiding vision and investment strategies for the organization. Paul spends much of his time on strategic partnerships, debt and equity relationships, investment underwriting and execution of a diverse portfolio of development projects. Paul has direct experience in multifamily, industrial, self-storage, senior living, office, hospitality, and mixed-use developments and acquisitions.",
    "biop2": "Paul is a creative problem solver. He is known for his unique ability to design and execute strategies with which everyone wins. He is a team builder. He has a great mind for structured finance who also has a comprehensive understanding of and ability to build and navigate real estate valuation models for various asset classes.",
    "biop3": "Paul earned his BS degree in International Relations cum laude from Brigham Young University and his MBA, with an emphasis in Finance and Entrepreneurship, from BYU’s Marriott School of Management.",
    "linkedin": "https://www.linkedin.com/in/paul-ritchie-56729a36/"
  },
  {
    "name": "Jayson Newitt",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1641248685/images/Headshots-1-2022/Jayson_Newitt_sq3hah.jpg",
    "title": "Founder & Principal",
    "biop1": "Jayson Newitt is a co-Founder and Managing Partner of The Ritchie Group.  He has been working in real estate development since 1996 and plays key management roles in some of The Ritchie Group’s primary developments with an emphasis on project management activities. Prior to joining The Ritchie Group, Jayson was a partner with The Boyer Company which included managing development projects in several states throughout the country.  Jayson worked in Washington D.C. for Marriott International where he participated in a Leadership Development Program with corporate rotational assignments in architecture and construction, finance, strategy, e-commerce, and brand management.",
    "biop2": "Jayson received an MBA from the Marriott School of Management at Brigham Young University and a Bachelor of Science degree in Construction Management from Brigham Young University. ",
    "linkedin": "https://www.linkedin.com/in/jayson-newitt-a82a5714/"
  },
  {
    "name": "Rob Heywood",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1641248686/images/Headshots-1-2022/Robert_Heywood_zxedyr.jpg",
    "title": "Founder & Principal",
    "biop1": " Prior to joining The Ritchie Group, Rob served as a Vice President of Ritchie Enterprises and managed several single family residential developments from acquisition to exit. Rob’s real estate matriculation has included the purchase, rehabilitation and sale of distressed properties, the entitlement of nearly 1,000 single family building lots, management of a substantial portfolio of commercial properties, and project manager of a 46-acre industrial park near the Salt Lake International Airport. Rob received his Bachelor of Arts Degree in English from Brigham Young University.",
    "linkedin": "https://www.linkedin.com/in/rob-heywood-0700988/"
  },
  {
    "name": "Ryan Ritchie",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1644949419/images/Headshots-1-2022/Ryan_Ritchie_ctq8oh.jpg",
    "title": "Founder & Principal",
    "biop1": "Ryan Ritchie is a Co-Founder and Managing Partner of The Ritchie Group (TRG).  He has been instrumental in setting the direction and vision for the Company.  His primary roles at TRG include deal sourcing, project entitlements, design development, market feasibility, construction management, and overall project management of a design and construction team.",
    "biop2": "Ryan has a passion for creating great real estate. He believes strongly in the philosophy that the highest quality of real estate yields the best returns for the greatest public and private benefit.  Ryan received a Bachelor of Arts degree from Brigham Young University (BYU).",
    "linkedin": "https://www.linkedin.com/in/ryan-ritchie-1a123610/"
  },
  {
    "name": "Corey Berg",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1641248685/images/Headshots-1-2022/Corey_Berg_zmjtog.jpg",
    "title": "Principal & Project Management",
    "biop1": "Corey Berg is a Partner at The Ritchie Group leading the Industrial Practice focused on bulk distribution, data center, manufacturing and self-storage projects. His day to day roles consist of working in the areas of site acquisition, site planning, construction management, feasibility studies and project management for various projects.",
    "biop2": "Corey graduated from Brigham Young University with a BS in Accounting. In his free time Corey loves boating with family and friends.",
    "linkedin": "https://www.linkedin.com/in/corey-berg-0752a896/"
  },
  {
    "name": "Dean Clark",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1641248685/images/Headshots-1-2022/Dean_Clark_yxotar.jpg",
    "title": "Principal & Controller",
    "biop1": "Dean serves as The Ritchie Group’s controller and the Director of Information Systems. Prior to joining TRG, Dean Clark worked as an accountant performing audits in the construction industry. Prior to his involvement at the CPA firm Dean was the Controller and CFO for Hyperbaric Medicine Group, which constructed and operated hyperbaric clinics. He also served as the CFO of Mountain View Hospital in Idaho Falls, Idaho, where he oversaw the companies start-up development, financial operations, cash management, purchasing, information systems, and developed company pro formas and financial forecasting analysis. Dean also served as the Controller and Director of Information Systems for ASC Group, a firm that constructed and operated surgical hospitals throughout the country. Dean received his undergraduate degree and a Masters in Business Administration from Brigham Young University. He is also a Certified Public Accountant and a Microsoft Certified Systems Engineer (MCSE).",
    "linkedin": "https://www.linkedin.com/in/dean-clark-418b8b23/"
  },
  {
    "name": "Scott Laneri",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1641248686/images/Headshots-1-2022/Scott_Laneri_hboevx.jpg",
    "title": "Principal & Project Management",
    "biop1": "Scott joined The Ritchie Group in 2014. During his time at TRG, Scott has largely focused on developing multi-family and hospitality projects. He is involved with every step of the development process and specializes in financial analysis, deal sourcing, capital structuring, and development management.",
    "biop2": "Scott received a Master of Real Estate Development from the Eccles School of Business at the University of Utah. He graduated from the Jon M. Huntsman School of Business at Utah State University with honors and received Bachelor of Science Degrees in Finance and Economics. In his free time, Scott enjoys skiing, playing soccer, reading, and spending time with his family.",
    "linkedin": "https://www.linkedin.com/in/scottlaneri/"
  },
  {
    "name": "Dave Hennefer",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1641248685/images/Headshots-1-2022/Dave_Hennefer_vqfqkp.jpg",
    "title": "Project Management",
    "biop1": "David A. Hennefer, is a Project Manager with a focus on the development of industrial parks and bulk distribution facilities in Utah. Prior to joining the Ritchie Group, Dave served as Executive Vice-President of Equitec Financial Group, a New York Stock Exchange company based in Oakland California, and as President of Equitec Properties Company, a wholly owned subsidiary, with 2500 employees and with 4 billion of real estate holdings located nationally in most major metropolitan cities. He served in this position for 10 years. Dave was recruited to become the President and CEO of Pacific Eagle Holdings, where he would serve for next 22 years. Pacific Eagle Holding was a large US national real estate company which was a wholly owned subsidiary of the Great Eagle Holdings Corporation, a public company listed on the Hong Kong Stock Exchange. At the time Dave Joined the Ritchie Group, he was serving as Executive Vice President of Coldwell Banker in Utah. Dave Graduated from Brigham Young University in 1972 with a Bachelor of Science Degree in Sociology.",
    "linkedin": "https://www.linkedin.com/in/david-hennefer-99a386b4/"
  },
  {
    "name": "Tyler Ritchie",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1641248686/images/Headshots-1-2022/Tyler_Ritchie_ecut2k.jpg",
    "title": "Principal & Operations",
    "biop1": "Tyler joined The Ritchie Group in 2018 as a Project Manager. Prior to returning to Salt Lake City, Tyler spent 13 years with a Las Vegas title company overseeing title and escrow operations, and helped the company grow from the ground up to become a top 5 title company in Nevada. Currently, Tyler oversees the daily operations of The Ritchie Group including securities compliance, transaction closing, investor relations, and information technology.",
    "biop2": "Tyler graduated from Brigham Young University with a Bachelor’s degree in Human biology. When not in the office, Tyler enjoys time with his family, catching up on technology trends, playing the piano, and tackling a home improvement project with his wife.",
    "linkedin": ""
  },
  {
    "name": "Stephanie Acton",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1641248686/images/Headshots-1-2022/Stephanie_Acton_fa8n0b.jpg",
    "title": "Accounting",
    "biop1": "Stephanie Acton has been working as a Project Accountant at The Ritchie Group since 2017. Prior to joining The Ritchie Group, she worked in Commercial Property Management for over 5 years in Park City, Utah. Stephanie received a Bachelor of Science Degree in Accounting & Business Management from the Woodbury School of Business at Utah Valley University. When she isn’t crunching numbers, she can be found riding her mountain bike near Little Dell Reservoir.",
    "linkedin": "https://www.linkedin.com/in/stephanie-leavitt-slc/"
  },
  {
    "name": "David Womeldorf",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1641248685/images/Headshots-1-2022/David_Womeldorf_iq3wbt.jpg",
    "title": "Accounting ",
    "biop1": "David’s career began in public accounting with a Big Four accounting firm. There he worked in the tax department spending much of his time on partnerships. Following public accounting, David’s accounting and tax experience has been with global and regional companies as well as small businesses. He is a licensed CPA and is a member of the AICPA and UACPA.",
    "biop2": "David earned his bachelor’s degree in History from Brigham Young University and a Master of Accounting from San Diego State University. Outside of work, David enjoys spending time with his family, long distance running, sports, and music.",
    "linkedin": "https://www.linkedin.com/in/david-womeldorf-9065981a9/"
  },
  {
    "name": "Jonathan Ritchie",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1641248686/images/Headshots-1-2022/Jonathan_Ritchie_yrqnjm.jpg",
    "title": "Principal & Project Management",
    "biop1": " Jonathan works as a analyst and project manager for TRG. Jonathan is currently working on several multifamily and hospitality projects for TRG.",
    "linkedin": "https://www.linkedin.com/in/jonathan-ritchie-12b1a85/"
  },
  {
    "name": "Scott Maloof",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1643159110/images/Headshots-1-2022/Scott_Maloof_zj2iyj.jpg",
    "title": "Property Management",
    "biop1": "Scott joined The Ritchie Group December 2021 as a Senior Property Manager. Prior to The Ritchie Group, Scott was a Property Manager at Cushman & Wakefield. As Property Manager, Scott managed a variety of office, retail, and industrial properties throughout the Wasatch Front. His responsibilities include creating annual budgets for operating and capital expenses, calculating annual operating expenses, preparing accurate and complete monthly financial reports.",
    "biop2": "Scott’s educational background is communications with an emphasis in public relations at Utah Valley University. Outside of the office, Scott enjoys spending time with his wife and two children and participates in Building Owners and Manager Association (BOMA)",
    "linkedin": "https://www.linkedin.com/in/scott-maloof-39680478/"
  },
  {
    "name": "Bryson Ritchie",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1644369332/images/Headshots-1-2022/Bryson_Ritchie_c6dsfm.jpg",
    "title": "Assistant Project Manager",
    "biop1": "Bryson Ritchie joined The Ritchie Group in 2021 as an Assistant Project Manager. Bryson has experience working in commercial construction management, multifamily acquisitions, and multifamily development. His primary responsibilities at The Ritchie Group include project management for multifamily and mixed-use properties.",
    "biop2": "Bryson received a Bachelor of Science degree in Construction Management with a Minor in Management from Brigham Young University. In his free time, Bryson enjoys skiing, hiking, following sports, and being outdoors.",
    "linkedin": "https://www.linkedin.com/in/bryson-ritchie-345630194/"
  },
  {
    "name": "Connor Clark",
    "headshot": "https://res.cloudinary.com/dgjw3jwe3/image/upload/f_auto,q_auto/v1644369332/images/Headshots-1-2022/Connor_Clark_cq8mp4.jpg",
    "title": "Assistant Project Manager",
    "biop1": "Connor Clark originally joined The Ritchie Group in 2020 and returned in 2022 as an Assistant Project Manager and Financial Analyst. Prior to this, he has had exposure to various classes of real estate transactions, including industrial development, multifamily development, multifamily acquisitions, and portfolio management. Most recently, Connor spent time with USAA Real Estate on their Industrial Development and Portfolio Management teams. His primary responsibilities at the Ritchie Group include project management for multifamily properties and financial analysis of deal flow within the company.",
    "biop2": "Connor received a Bachelor of Science degree in Finance with an emphasis in real estate from the Marriott School of Business at Brigham Young University. Outside of work, Connor enjoys backpacking, skiing, mountain biking, reading, playing sports, and picking up new hobbies.",
    "linkedin": "https://www.linkedin.com/in/connorrclark/"
  }
]
